In [2]:
import pandas as pd
and_data = pd.read_csv('ANDHRA_PD.csv')
and_data.head()

,Year,AQI,CO,Temp,Humidity,Precipitation,Population,Malaria_Cases,Malaria_Death,Dengue_Cases,Kalaazar_Cases,Rainfall,Malaria_Incidence
0,2015,127.690608,0.748287,26.819635,51.720091,0.039897,52618984,25152,3,805,4,857.3,47.800239
1,2014,121.851093,0.821107,26.253301,54.376480,0.045048,51841364,33393,20,910,0,746.4,64.413814
2,2013,112.439726,0.254301,27.177968,47.469749,0.041450,51075235,34949,5,2299,7,1348.5,68.426508
3,2012,97.556164,0.621726,27.814384,47.174087,0.047454,50320429,24699,2,1209,0,1008.6,49.083445
4,2011,93.980822,0.570110,28.015639,55.852740,0.235377,49576777,13351,0,776,1,753.1,26.929947

In [3]:
delhi_data = pd.read_csv('ANDHRA_PD.csv')
delhi_data.head()

,Year,AQI,CO,Temp,Humidity,Precipitation,Population,Malaria_Cases,Malaria_Death,Dengue_Cases,Kalaazar_Cases,Rainfall,Malaria_Incidence
0,2015,127.690608,0.748287,26.819635,51.720091,0.039897,52618984,25152,3,805,4,857.3,47.800239
1,2014,121.851093,0.821107,26.253301,54.376480,0.045048,51841364,33393,20,910,0,746.4,64.413814
2,2013,112.439726,0.254301,27.177968,47.469749,0.041450,51075235,34949,5,2299,7,1348.5,68.426508
3,2012,97.556164,0.621726,27.814384,47.174087,0.047454,50320429,24699,2,1209,0,1008.6,49.083445
4,2011,93.980822,0.570110,28.015639,55.852740,0.235377,49576777,13351,0,776,1,753.1,26.929947

In [5]:
kar_data = pd.read_csv('KARNATAKA.csv')
kar_data.head()

,Year,AQI,CO,Temp,Humidity,Precipitation,Population,Malaria_Cases,Malaria_Death,Dengue_Cases,Kalaazar_Cases,Rainfall,Malaria_Incidence
0,2015,106.497260,5.482808,23.849087,65.878425,0.061587,64844321,36859,0,2842,354,1112.5,56.842295
1,2014,104.532787,1.301858,23.949226,63.342668,0.050979,63886031,44319,11,6408,595,1184.2,69.371973
2,2013,87.149315,1.052904,24.145434,63.423059,0.081233,62941902,24237,0,3924,995,1110.7,38.506939
3,2012,86.419178,0.945671,24.631050,60.087557,0.074178,62011726,16466,0,405,1962,877.8,26.553043
4,2011,91.602740,0.901753,25.017466,62.811986,0.226941,61095297,10170,5,2285,1482,1087.2,16.646126

In [6]:
mah_data = pd.read_csv('MAHARASHTRA.csv')
mah_data.head()

,Year,AQI,CO,Temp,Humidity,Precipitation,Population,Malaria_Cases,Malaria_Death,Dengue_Cases,Kalaazar_Cases,Rainfall,Malaria_Incidence
0,2015,75.551104,0.00000,27.694406,66.351484,0.115354,119270021,93818,58,6485,0,644.5,78.660169
1,2014,74.654538,0.00000,27.136043,67.408698,0.181432,117507410,139198,96,5610,0,838.0,118.458912
2,2013,73.757972,0.00000,27.697374,66.217580,0.125240,115770847,96577,118,2931,0,836.0,83.420829
3,2012,92.953771,1.57526,28.235616,64.683219,0.083447,114059948,58517,200,1138,0,689.8,51.303723
4,2011,107.950685,1.27174,28.382763,67.288242,0.346090,112374333,37068,227,1485,0,852.6,32.986180

In [8]:
tam_data = pd.read_csv('TAMIL_NADU.csv')
tam_data.head()

,Year,AQI,CO,Temp,Humidity,Precipitation,Population,Malaria_Cases,Malaria_Death,Dengue_Cases,Kalaazar_Cases,Rainfall,Malaria_Incidence
0,2015,161.479452,2.380151,24.734703,55.760274,0.048790,76574228,14988,0,2074,1,1204.6,19.573165
1,2014,136.199454,1.129003,24.312500,57.611758,0.054474,75442589,17086,0,6122,4,913.0,22.647685
2,2013,104.343836,0.220877,24.746918,57.843579,0.060502,74327674,22171,0,12826,6,741.9,29.828728
3,2012,105.490411,0.870411,25.424886,56.199429,0.055639,73229235,18869,3,2501,5,636.1,25.767031
4,2011,102.942466,0.864027,26.176256,53.920776,0.204041,72147030,13075,1,2051,12,926.5,18.122714

In [9]:
utt_data = pd.read_csv('UTTAR_PD.csv')
utt_data.head()

,Year,AQI,CO,Temp,Humidity,Precipitation,Population,Malaria_Cases,Malaria_Death,Dengue_Cases,Kalaazar_Cases,Rainfall,Malaria_Incidence
0,2015,308.276013,12.862882,27.936073,46.130251,0.063881,212073536,55437,0,119,11,603.3,26.140461
1,2014,323.836867,13.326556,27.604850,48.134677,0.067953,208939444,64606,0,1414,11,701.8,30.920921
2,2013,283.153320,91.218036,27.779452,45.797146,0.056644,205851669,56968,0,342,5,1041.4,27.674296
3,2012,622.550685,33.369493,28.118379,44.859817,0.062089,202809526,47400,0,155,11,602.4,23.371683
4,2011,519.804110,25.995068,28.867009,49.020890,0.275445,199812341,41891,0,960,14,781.2,20.965172